#### Terraform Plan 📖
```
module.worker_test.cloudflare_worker_script.this: Refreshing state... [id=test-worker]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vercel_test_project.vercel_project.this will be created
  + resource "vercel_project" "this" {
      + auto_assign_custom_domains                        = false
      + automatically_expose_system_environment_variables = (known after apply)
      + customer_success_code_visibility                  = false
      + directory_listing                                 = (known after apply)
      + framework                                         = "nextjs"
      + function_failover                                 = (known after apply)
      + git_fork_protection                               = true
      + git_lfs                                           = false
      + id                                                = (known after apply)
      + name                                              = "vercel-test-project"
      + node_version                                      = (known after apply)
      + oidc_token_config                                 = {
          + enabled     = false
          + issuer_mode = "global"
        }
      + prioritise_production_builds                      = (known after apply)
      + protection_bypass_for_automation_secret           = (sensitive value)
      + public_source                                     = false
      + resource_config                                   = (known after apply)
      + serverless_function_region                        = (known after apply)
      + team_id                                           = (known after apply)
      + vercel_authentication                             = {
          + deployment_type = "standard_protection"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Warning: Deprecated Resource

  with module.worker_test.cloudflare_worker_script.this,
  on modules/cloudflare_worker/main.tf line 1, in resource "cloudflare_worker_script" "this":
   1: resource "cloudflare_worker_script" "this" {

`cloudflare_worker_script` is now deprecated and will be removed in the next
major version. Use `cloudflare_workers_script` instead.

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```
_Pusheado por: @alexanderovie_